<template>
  <div>
    <div class="container mt-5 mb-md-4 pt-5">
      <nav class="mb-3 pt-md-3" aria-label="breadcrumb">
        <ol class="breadcrumb">
          <li class="breadcrumb-item">
            <a href="/">خانه</a>
          </li>
          <li class="breadcrumb-item active" aria-current="page">
            سوالات متداول
          </li>
        </ol>
      </nav>
    </div>
    <!-- Page header-->
    <section class="container mb-4 pb-lg-5">
      <h1 class="mx-auto mb-4 pb-2 text-center" style="max-width: 856px">
        سلام چجوری میتونیم کمک کنیم؟
      </h1>
      <!-- Search form-->
      <form class="form-group mb-4">
        <div class="input-group input-group-lg">
          <input
            class="form-control"
            type="text"
            placeholder="دنبال چی میگردی؟"
          />
        </div>
        <button class="btn btn-primary btn-lg px-sm-4 px-3" type="submit">
          <i class="fi-search me-sm-2"></i
          ><span class="d-sm-inline d-none">جستجو</span>
        </button>
      </form>
      <div class="d-flex flex-md-row flex-column align-items-md-center">
        <div class="pb-2 mb-2 me-2 flex-shrink-0 fw-bold">بخش های محبوب:</div>
        <div class="text-nowrap overflow-auto pb-2">
          <div>
            <a
              class="btn btn-xs btn-outline-secondary rounded-pill fw-normal mb-2 me-2"
              href="#"
              >نوتیفیکشن</a
            ><a
              class="btn btn-xs btn-outline-secondary rounded-pill fw-normal mb-2 me-2"
              href="#"
              >عضویت در سایت</a
            ><a
              class="btn btn-xs btn-outline-secondary rounded-pill fw-normal mb-2 me-2"
              href="#"
              >روند معاملات</a
            ><a
              class="btn btn-xs btn-outline-secondary rounded-pill fw-normal mb-2 me-2"
              href="#"
              >سوالات حساب کاربری</a
            ><a
              class="btn btn-xs btn-outline-secondary rounded-pill fw-normal mb-2 me-2"
              href="#"
              >رهن مسکن</a
            ><a
              class="btn btn-xs btn-outline-secondary rounded-pill fw-normal mb-2 me-2"
              href="#"
              >راهنما</a
            >
          </div>
        </div>
      </div>
    </section>
    <!-- Page content-->
    <section class="container mb-md-5 mb-4 pb-lg-5">
      <div class="row">
        <!-- Sidebar offcanvas-->
        <aside class="col-xl-2 col-lg-3">
          <div class="offcanvas-lg offcanvas-end" id="help-sidebar">
            <div class="offcanvas-header shadow-sm mb-2">
              <h2 class="h5 mb-0">سوالات متداول</h2>
              <button
                class="btn-close"
                type="button"
                data-bs-dismiss="offcanvas"
                data-bs-target="#help-sidebar"
              ></button>
            </div>
            <div class="offcanvas-body">
              <ul
                class="nav nav-tabs navbar-nav flex-column m-0 text-lg-center"
              >
                <li class="nav-item px-0">
                  <a class="nav-link  px-3"
                  :class="{ active: activeTabs === 'tenant' }"
                  @click="handelTabs('tenant')" href="#"
                    >مستاجران و اجاره ها</a
                  >
                </li>
                <li class="nav-item px-0">
                  <a class="nav-link px-3"
                  :class="{ active: activeTabs === 'buy' }"
                  @click="handelTabs('buy')" href="#">خریداران ملک</a>
                </li>
                <li class="nav-item px-0">
                  <a class="nav-link px-3"
                  :class="{ active: activeTabs === 'landlord' }"
                  @click="handelTabs('landlord')" href="#">صاحبان املاک</a>
                </li>
                <li class="nav-item px-0">
                  <a class="nav-link px-3"
                  :class="{ active: activeTabs === 'Rent' }"
                  @click="handelTabs('Rent')" href="#">رهن و اجاره</a>
                </li>
                <li class="nav-item px-0">
                  <a class="nav-link px-3"
                  :class="{ active: activeTabs === 'Mobile' }"
                  @click="handelTabs('Mobile')" href="#">سوالات نسخه اپلیکیشن</a>
                </li>
              </ul>
            </div>
          </div>
        </aside>
        <!-- Content-->
        <div class="col-lg-9 offset-xl-1 col-lg-8 faq-real" v-if="activeTabs ==='tenant'">
          <h2 class="mb-md-4 mb-3 pb-md-2">  مستاجران و اجاره ها  </h2>
          <div class="pb-md-2">
            <h3 class="h5">چرا نمی توانم هویت خود را تأیید کنم؟</h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">
              چگونه می توانم درباره حقوق خود به عنوان مستاجر اطلاعات بیشتری کسب
              کنم؟
            </h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد.
            </p>
          </div>
        </div>
        <div class="col-lg-9 offset-xl-1 col-lg-8 faq-real" v-if="activeTabs ==='buy'">
          <h2 class="mb-md-4 mb-3 pb-md-2"> خریدارن ملک</h2>
          <div class="pb-md-2">
            <h3 class="h5">
              آیا لیست های اجاره ای در  برای کلاهبرداری فیلتر شده است؟
            </h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">لیست های اجاره ای چگونه در  قرار می گیرند؟</h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری
              موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد
              نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل
              دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">
              چگونه می توانم درباره حقوق خود به عنوان مستاجر اطلاعات بیشتری کسب
              کنم؟
            </h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">چگونه یک لیست اجاره مشکوک را گزارش کنم؟</h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">چرا نمی توانم هویت خود را تأیید کنم؟</h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">
              آیا می توانم از خدمات شما برای پرداخت هزینه های آب و برق به
              صاحبخانه خود استفاده کنم؟
            </h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">آیا می توانم اجاره چند ماهه را پیش پرداخت کنم؟</h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">چگونه از اطلاعات شخصی من محافظت می کنید؟</h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
            </p>
          </div>
          <div class="pb-md-2">
            <h3 class="h5">
              پس از پذیرش یا رد درخواست من چه اتفاقی برای اطلاعات من می افتد؟
            </h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد.
            </p>
          </div>
        </div>
        <div class="col-lg-9 offset-xl-1 col-lg-8 faq-real" v-if="activeTabs ==='landlord'">
          <h2 class="mb-md-4 mb-3 pb-md-2"> صاحبان ملک  </h2>
          <div class="pb-md-2">
            <h3 class="h5">
              پس از پذیرش یا رد درخواست من چه اتفاقی برای اطلاعات من می افتد؟
            </h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد.
            </p>
          </div>
        </div>
        <div class="col-lg-9 offset-xl-1 col-lg-8 faq-real" v-if="activeTabs ==='Rent'">
          <h2 class="mb-md-4 mb-3 pb-md-2">  رهن و اجاره  </h2>
          <div class="pb-md-2">
            <h3 class="h5">آیا می توانم اجاره چند ماهه را پیش پرداخت کنم؟</h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
              کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
              جامعه و متخصصان را می طلبد.
            </p>
          </div>
        </div>
        <div class="col-lg-9 offset-xl-1 col-lg-8 faq-real" v-if="activeTabs ==='Mobile'">
          <h2 class="mb-md-4 mb-3 pb-md-2">  سوالات اپلیکیشن  </h2>
          <div class="pb-md-2">
            <h3 class="h5">
              آیا می توانم از خدمات شما در نسخه موبایلی برای  پرداخت هزینه های آب و برق به
              صاحبخانه خود استفاده کنم؟
            </h3>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
              استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
              نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
            </p>
          </div>
        </div>
      </div>
    </section>
    <!-- Contact us-->
    <section class="container mb-5 pb-lg-5">
      <div class="row align-items-sm-center">
        <div class="col-sm-5">
          <img
            src="/real-estate/illustrations/support.svg"
            alt="Illustration"
            class="rotate-img"
          />
        </div>
        <div class="col-md-6 offset-md-1 col-sm-7 text-sm-end text-center">
          <h2 class="mb-4 pb-md-3">
            چیزی را که به دنبالش هستید پیدا نمی کنید؟
          </h2>
          <a class="btn btn-lg btn-primary" href="real-estate-contacts.html"
            >اکنون با ما تماس بگیرید!</a
          >
        </div>
      </div>
    </section>
  </div>
</template>
<script>
   export default {
    data() {
      return {
        activeTabs : "tenant",
      }
    },
    methods : {
      handelTabs(tab) {
        this.activeTabs = tab;
      }
    }
   }
</script>
<style scoped></style>
